### Many-to-1 data merge
In a many-to-one (or one-to-many) merge, one of the values will be duplicated and recycled in the output. That is, one of the keys in the merge is not unique.

Here, the two DataFrames site and visited have been pre-loaded once again. Note that this time, visited has multiple entries for the site column. Confirm this by exploring it in the IPython Shell.

The .merge() method call is the same as the 1-to-1 merge from the previous exercise, but the data and output will be different.

### Instructions

- Merge the site and visited DataFrames on the 'name' column of site and 'site' column of visited, exactly as you did in the previous exercise.
- Print the merged DataFrame and then hit 'Submit Answer' to see the different output produced by this merge!

In [19]:
import pandas as pd
site=pd.read_csv('site.csv')
#site=pd.DataFrame(site1)
print(site.columns)
print(site)
print(type(site))

Index(['name', 'lat', 'long'], dtype='object')
    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40
<class 'pandas.core.frame.DataFrame'>

In [20]:
print(site1.name)

0     DR-1
1     DR-3
2    MSK-4
Name: name, dtype: object

In [21]:
visited1=pd.read_csv('visited.csv')
visited=pd.DataFrame(visited1)
print(visited.columns)

Index(['ident', 'site', 'dated'], dtype='object')

In [22]:
print(visited.site)

0       DR-1
1       DR-1
2       DR-3
3       DR-3
4       DR-3
5       DR-3
6      MSK-4
7       DR-1
Name: site, dtype: object

In [23]:
# Merge the DataFrames: m2o
visited1 = visited.drop_duplicates()
m2o = pd.merge(left= site, right=visited, left_on='name', right_on='site')

# Print m2o
print(m2o)

Empty DataFrame
Columns: [name, lat, long, ident, site, dated]
Index: []

In [24]:
A=pd.read_csv('groupby.csv')

In [25]:
A

  Name   Sid Use_Case Revenue
0    A  xx01    Voice  $10.00
1    A  xx01      SMS  $10.00
2    B  xx02    Voice   $5.00
3    C  xx03    Voice  $15.00
4    C  xx03      SMS  $15.00
5    C  xx03    Video  $15.00

In [26]:
df = A.groupby('Name').agg({'Sid':'first', 
                             'Use_Case': ', '.join, 
                             'Revenue':'first' }).reset_index()
print (df[['Name','Sid','Use_Case','Revenue']] )

  Name   Sid           Use_Case Revenue
0    A  xx01         Voice, SMS  $10.00
1    B  xx02              Voice   $5.00
2    C  xx03  Voice, SMS, Video  $15.00

In [27]:
df = A.groupby(['Name','Sid','Revenue'])['Use_Case'].apply(', '.join).reset_index()

In [28]:
print(df[['Name','Sid','Use_Case','Revenue']])

  Name   Sid           Use_Case Revenue
0    A  xx01         Voice, SMS  $10.00
1    B  xx02              Voice   $5.00
2    C  xx03  Voice, SMS, Video  $15.00